"1 119 1 4206624770 ,"
"input 1 3 112 112 ,"
" 357 361 367 371 377 381 384 388 392 398 402 405 409 413 416 420 424 430 434 437 441 445 448 452 456 459 463 467 473 477 480 484 488 491 495 499 505 509 512 516 520 523 527 531 537 538 546 547 548 556 557 558 566 567 568 569 570 571 572 576 577 581 582 586 589 592 595 598 601 604 607 610 613 616 619 622 625 628 631 634 637 640 643 646 649 652 655 658 661 664 667 670 673 676 679 682 685 688 691 694 697 700 703 706 709 712 715 718 721 724 727 730 733 736 739 input pitch roll yaw ,"
"yaw pitch roll ,"
" 118 ,"
"Convolution Conv_0 1 1 input 586 1 3 32 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_1 1 1 586 357 0 0 ,"
"Convolution Conv_2 1 1 357 589 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_3 1 1 589 361 0 0 ,"
"Convolution Conv_4 1 1 361 592 1 32 16 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_5 1 1 592 595 1 16 96 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_6 1 1 595 367 0 0 ,"
"Convolution Conv_7 1 1 367 598 96 1 96 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_8 1 1 598 371 0 0 ,"
"Convolution Conv_9 1 1 371 601 1 96 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_10 1 1 601 604 1 24 144 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_11 1 1 604 377 0 0 ,"
"Convolution Conv_12 1 1 377 607 144 1 144 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_13 1 1 607 381 0 0 ,"
"Convolution Conv_14 1 1 381 610 1 144 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_15 2 1 601 610 384 ,"
"Convolution Conv_16 1 1 384 613 1 24 144 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_17 1 1 613 388 0 0 ,"
"Convolution Conv_18 1 1 388 616 144 1 144 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_19 1 1 616 392 0 0 ,"
"Convolution Conv_20 1 1 392 619 1 144 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_21 1 1 619 622 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_22 1 1 622 398 0 0 ,"
"Convolution Conv_23 1 1 398 625 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_24 1 1 625 402 0 0 ,"
"Convolution Conv_25 1 1 402 628 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_26 2 1 619 628 405 ,"
"Convolution Conv_27 1 1 405 631 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_28 1 1 631 409 0 0 ,"
"Convolution Conv_29 1 1 409 634 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_30 1 1 634 413 0 0 ,"
"Convolution Conv_31 1 1 413 637 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_32 2 1 405 637 416 ,"
"Convolution Conv_33 1 1 416 640 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_34 1 1 640 420 0 0 ,"
"Convolution Conv_35 1 1 420 643 192 1 192 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_36 1 1 643 424 0 0 ,"
"Convolution Conv_37 1 1 424 646 1 192 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_38 1 1 646 649 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_39 1 1 649 430 0 0 ,"
"Convolution Conv_40 1 1 430 652 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_41 1 1 652 434 0 0 ,"
"Convolution Conv_42 1 1 434 655 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_43 2 1 646 655 437 ,"
"Convolution Conv_44 1 1 437 658 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_45 1 1 658 441 0 0 ,"
"Convolution Conv_46 1 1 441 661 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_47 1 1 661 445 0 0 ,"
"Convolution Conv_48 1 1 445 664 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_49 2 1 437 664 448 ,"
"Convolution Conv_50 1 1 448 667 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_51 1 1 667 452 0 0 ,"
"Convolution Conv_52 1 1 452 670 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_53 1 1 670 456 0 0 ,"
"Convolution Conv_54 1 1 456 673 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_55 2 1 448 673 459 ,"
"Convolution Conv_56 1 1 459 676 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_57 1 1 676 463 0 0 ,"
"Convolution Conv_58 1 1 463 679 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_59 1 1 679 467 0 0 ,"
"Convolution Conv_60 1 1 467 682 1 384 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_61 1 1 682 685 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_62 1 1 685 473 0 0 ,"
"Convolution Conv_63 1 1 473 688 576 1 576 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_64 1 1 688 477 0 0 ,"
"Convolution Conv_65 1 1 477 691 1 576 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_66 2 1 682 691 480 ,"
"Convolution Conv_67 1 1 480 694 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_68 1 1 694 484 0 0 ,"
"Convolution Conv_69 1 1 484 697 576 1 576 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_70 1 1 697 488 0 0 ,"
"Convolution Conv_71 1 1 488 700 1 576 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_72 2 1 480 700 491 ,"
"Convolution Conv_73 1 1 491 703 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_74 1 1 703 495 0 0 ,"
"Convolution Conv_75 1 1 495 706 576 1 576 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_76 1 1 706 499 0 0 ,"
"Convolution Conv_77 1 1 499 709 1 576 160 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_78 1 1 709 712 1 160 960 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_79 1 1 712 505 0 0 ,"
"Convolution Conv_80 1 1 505 715 960 1 960 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_81 1 1 715 509 0 0 ,"
"Convolution Conv_82 1 1 509 718 1 960 160 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_83 2 1 709 718 512 ,"
"Convolution Conv_84 1 1 512 721 1 160 960 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_85 1 1 721 516 0 0 ,"
"Convolution Conv_86 1 1 516 724 960 1 960 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_87 1 1 724 520 0 0 ,"
"Convolution Conv_88 1 1 520 727 1 960 160 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_89 2 1 512 727 523 ,"
"Convolution Conv_90 1 1 523 730 1 160 960 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_91 1 1 730 527 0 0 ,"
"Convolution Conv_92 1 1 527 733 960 1 960 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_93 1 1 733 531 0 0 ,"
"Convolution Conv_94 1 1 531 736 1 960 320 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_95 1 1 736 739 1 320 1280 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_96 1 1 739 537 0 0 ,"
"Pooling GlobalAveragePool_97 1 1 537 538 1 0 0 1 1 0 0 -1 -1 -1 0 ,"
"Reshape Reshape_103 1 1 538 546 0 4 4 0 -1 1 1 ,"
"InnerProduct Gemm_104 1 1 546 547 120 1 0 1 ,"
"Pooling GlobalAveragePool_105 1 1 537 548 1 0 0 1 1 0 0 -1 -1 -1 0 ,"
"Reshape Reshape_111 1 1 548 556 0 4 4 0 -1 1 1 ,"
"InnerProduct Gemm_112 1 1 556 557 120 1 0 1 ,"
"Pooling GlobalAveragePool_113 1 1 537 558 1 0 0 1 1 0 0 -1 -1 -1 0 ,"
"Reshape Reshape_119 1 1 558 566 0 4 4 0 -1 1 1 ,"
"InnerProduct Gemm_120 1 1 566 567 120 1 0 1 ,"
"Sigmoid Sigmoid_121 1 1 547 568 ,"
"Sigmoid Sigmoid_122 1 1 557 569 ,"
"Sigmoid Sigmoid_123 1 1 567 570 ,"
"ReduceL1 ReduceL1_124 1 1 568 571 1 1 ,"
"Clip Clip_125 1 1 571 572 1e-12 inf ,"
"Div Div_128 2 1 568 572 yaw ,"
"ReduceL1 ReduceL1_129 1 1 569 576 1 1 ,"
"Clip Clip_130 1 1 576 577 1e-12 inf ,"
"Div Div_133 2 1 569 577 pitch ,"
"ReduceL1 ReduceL1_134 1 1 570 581 1 1 ,"
"Clip Clip_135 1 1 581 582 1e-12 inf ,"
"Div Div_138 2 1 570 582 roll ,"
